CSI API ETABS v1
cDatabaseTables.SetLoadCombinationsSelectedForDisplay Method
 Sets the load combinations that are selected for table display.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoadCombinationsSelectedForDisplay(
	ref string[] LoadCombinationList
)
Function SetLoadCombinationsSelectedForDisplay (
	ByRef LoadCombinationList As String()
) As Integer
Dim instance As cDatabaseTables
Dim LoadCombinationList As String()
Dim returnValue As Integer
returnValue = instance.SetLoadCombinationsSelectedForDisplay(LoadCombinationList)
int SetLoadCombinationsSelectedForDisplay(
	array<String^>^% LoadCombinationList
)
abstract SetLoadCombinationsSelectedForDisplay :
        LoadCombinationList : string[] byref -> int
Parameters
LoadCombinationList
Type: System.String[]
Input Item: The zero-based list of load combinations selected for table display.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 This list sets the load combinations that are included when displaying analysis results. If no load combinations are to be selected then the LoadCombinationList item should include a single blank string.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace